@echo off
chcp 65001 >nul
setlocal enabledelayedexpansion
color 0a
cls

echo:
echo:
echo ██████╗  ██████╗  ███████╗ ███████╗  ██████╗  ███████╗ ███╗   ██╗
echo ██╔══██╗ ██╔══██╗ ██╔════╝ ██╔════╝ ██╔════╝  ██╔════╝ ████╗  ██║
echo ██████╔╝ ██████╔╝ █████╗   ███████╗ ██║  ███╗ █████╗   ██╔██╗ ██║
echo ██╔═══╝  ██╔══██╗ ██╔══╝   ╚════██║ ██║   ██║ ██╔══╝   ██║╚██╗██║
echo ██║      ██║  ██║ ███████╗ ███████║ ╚██████╔╝ ███████╗ ██║ ╚████║
echo ╚═╝      ╚═╝  ╚═╝ ╚══════╝ ╚══════╝  ╚═════╝  ╚══════╝ ╚═╝  ╚═══╝
echo:
echo:
echo Presione Enter para actualizar el programa
pause

python ./update.py

color 0a

:: Ejecuta pyinstaller en segundo plano
pyinstaller .\bin\main.py --specpath .\specs\ --name Presgen --icon .\media\PressGenLogo.png --onedir -y
pause

cls
echo Compilacion finalizada!.
echo Actualizacion Completa!
pause
